app/Http/Controllers/ClienteController.php

select * from `clientes` order by `id_cliente` desc limit 10 offset 0
select count(*) as aggregate from `clientes`
---
    public function index()
    {
        $cliente = Cliente::orderBy('id_cliente','desc')
        ->paginate(10);

insert into `clientes` (`nome`, `email`, `dt_nascimento`, `cpf`, `endereco`, `updated_at`, `created_at`) values ('Teste', 'teste@teste', '2023-09-04', '42896492895', 'testes', '2023-09-28 00:40:45', '2023-09-28 00:40:45')
---
    public function store(Request $request)
    {
        // dd($request->all());

        Cliente::create($request->all());

select * from `clientes` where `clientes`.`id_cliente` = 33 limit 1
---
    public function show(int $id)
    {
        $cliente = Cliente::with([
            'id_cliente',
            'id_cliente',

        ])->find($id);

select * from `clientes` where `clientes`.`id_cliente` = 34 limit 1
update `clientes` set `nome` = 'muriloverse', `cpf` = '458125577', `email` = 'murilo.honoro.correa@gmail.com', `endereco` = 'rua portas', `clientes`.`updated_at` = '2023-09-29 01:05:44' where `id_cliente` = 34
select * from `clientes` where `clientes`.`id_cliente` = 26 limit 1
---
    public function update(Request $request, Int $id)
    {
        $cliente = Cliente::find($id);
        $cliente->update($request->all());
        return redirect()
            ->route('cliente.index')
            ->with('atualizado', ' Cliente Atualizado com sucesso!');